Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
// ----------------------------------------------------------------------------
// -                        CloudViewer: www.cloudViewer.org                  -
// ----------------------------------------------------------------------------
// Copyright (c) 2018-2024 www.cloudViewer.org
// SPDX-License-Identifier: MIT
// ----------------------------------------------------------------------------

#include "SAM3Dialog.h"

#include <CVLog.h>
#include <aicore/backend_capi.h>
#include <aicore/sam3_capi.h>

#ifdef HAS_OPENCV_FACE_CAPTURE
#include "VideoTab.h"
#endif

#include <ecvAICoreUiHelper.h>
#include <ecvClickableImageLabel.h>
#include <ecvImage.h>
#include <ecvMainAppInterface.h>
#include <ecvPluginDbNaming.h>

#include <QButtonGroup>
#include <QCheckBox>
#include <QCloseEvent>
#include <QComboBox>
#include <QDoubleSpinBox>
#include <QDragEnterEvent>
#include <QDropEvent>
#include <QFileDialog>
#include <QFileInfo>
#include <QFormLayout>
#include <QGroupBox>
#include <QHBoxLayout>
#include <QImage>
#include <QKeyEvent>
#include <QLabel>
#include <QLineEdit>
#include <QListWidget>
#include <QMessageBox>
#include <QMimeData>
#include <QPainter>
#include <QProgressBar>
#include <QPushButton>
#include <QRadioButton>
#include <QScrollArea>
#include <QSettings>
#include <QShowEvent>
#include <QSplitter>
#include <QStackedWidget>
#include <QVBoxLayout>
#include <cstring>

#include "ecvModelDownloader.h"

namespace {

// SAM3 test data lives in the shared ecvTestDataRepository SAM3 dataset
// (images/ + videos/ under ~/cloudViewer_data/extract/sam_test_data).

const aicore_sam3_model_entry* catalogEntry(const QString& filename) {
    return aicore_sam3_model_by_filename(filename.toUtf8().constData());
}

bool isValidCatalogModel(const QString& path, const QString& filename) {
    const auto* entry = catalogEntry(filename);
    // Presence check: integrity-ledger stat-trust (digest pinned per
    // release asset), falling back to the catalog's exact size for files
    // downloaded before the ledger existed. Never hashes (multi-GB GGUFs
    // on dialog paths).
    return entry &&
           ecvAssetIntegrity::isVerified(
                   path,
                   {QCryptographicHash::Sha256,
                    ecvAssetIntegrity::PinnedDigest(
                            QString::fromUtf8(entry->filename))},
                   64 * 1024, true, ecvAssetIntegrity::OnMiss::CheapChecksOnly,
                   entry->size_bytes);
}

// Why the selected catalog model cannot be loaded as-is. modelPath()
// falls back to the bare filename when the release check fails, so
// prompts must classify before claiming the GGUF "was not downloaded".
enum class ModelFileStatus { Missing, Unverified, Verified };

QString cachedModelPath(const QString& filename) {
    char* dir = aicore_sam3_model_cache_dir();
    const QString cacheDir = QString::fromUtf8(dir);
    aicore_sam3_free_buffer(dir);
    return cacheDir + QLatin1Char('/') + filename;
}

QString modelDisplayPath(const QString& filename) {
    const QFileInfo selected(filename);
    return selected.isAbsolute() ? filename : cachedModelPath(filename);
}

ModelFileStatus classifyModelFile(const QString& filename) {
    if (filename.isEmpty() || filename == "__browse__") {
        return ModelFileStatus::Missing;
    }
    const QFileInfo selected(filename);
    // An explicitly browsed absolute path bypasses the release check.
    if (selected.isAbsolute()) {
        return selected.isFile() ? ModelFileStatus::Verified
                                 : ModelFileStatus::Missing;
    }
    const QString full = cachedModelPath(filename);
    if (!QFileInfo(full).isFile()) return ModelFileStatus::Missing;
    return isValidCatalogModel(full, filename) ? ModelFileStatus::Verified
                                               : ModelFileStatus::Unverified;
}

}  // namespace

// ---------------------------------------------------------------------------
// SAM3Canvas implementation
// ---------------------------------------------------------------------------

SAM3Canvas::SAM3Canvas(QWidget* parent) : QLabel(parent) {
    setAcceptDrops(true);
    setMinimumSize(ecvAICoreUi::dpiScaled(320), ecvAICoreUi::dpiScaled(240));
    setAlignment(Qt::AlignCenter);
    setStyleSheet(
            "QLabel { background: #1a1a26; border: 1px solid #333;"
            " border-radius: 4px; color: #666; font-size: 13px; }");
    updatePlaceholderText();
}

void SAM3Canvas::updatePlaceholderText() {
    setText(
            tr("Step 1: drop an image here (or load test data)\n"
               "Step 2: type a text prompt, or click on the object /\n"
               "        drag a box (the model loads automatically)\n"
               "(left-click +point · right-click -point · drag box)"));
}

void SAM3Canvas::setInteractive(bool on) {
    m_interactive = on;
    if (!on)
        setCursor(Qt::ArrowCursor);
    else
        setCursor(Qt::CrossCursor);
}

void SAM3Canvas::setImage(const QImage& img) {
    m_original = img;
    m_overlay = img.copy();
    m_maskOverlay = QImage();
    clearPoints();  // also resets box state
    m_dragging = false;
    setPixmap(QPixmap::fromImage(m_overlay.scaled(size(), Qt::KeepAspectRatio,
                                                  Qt::SmoothTransformation)));
    setText(QString());
}

void SAM3Canvas::setMaskOverlay(const QImage& mask) { m_maskOverlay = mask; }

void SAM3Canvas::clearMaskOverlay() { m_maskOverlay = QImage(); }

void SAM3Canvas::setDetections(const QVector<SAM3DetBox>& detections) {
    m_detections = detections;
}

void SAM3Canvas::clearDetections() { m_detections.clear(); }

void SAM3Canvas::setExemplars(const QVector<QRectF>& exemplars) {
    m_exemplars = exemplars;
}

void SAM3Canvas::clearExemplars() { m_exemplars.clear(); }

void SAM3Canvas::setExemplarMode(bool on) { m_exemplarMode = on; }

bool SAM3Canvas::isInsideImage(const QPointF& p) const {
    return !m_original.isNull() && p.x() >= 0 && p.y() >= 0 &&
           p.x() < static_cast<double>(m_original.width()) &&
           p.y() < static_cast<double>(m_original.height());
}

void SAM3Canvas::updateOverlay() {
    if (m_original.isNull()) return;
    QImage display = m_original.copy();
    QPainter p(&display);
    // Layer order: image → mask → point/box annotations
    if (!m_maskOverlay.isNull()) {
        p.drawImage(0, 0, m_maskOverlay);
    }
    drawAnnotations(p, display);
    p.end();
    m_overlay = display;
    setPixmap(QPixmap::fromImage(display.scaled(size(), Qt::KeepAspectRatio,
                                                Qt::SmoothTransformation)));
}

void SAM3Canvas::resizeEvent(QResizeEvent* e) {
    QLabel::resizeEvent(e);
    // Keep the displayed pixmap in sync with the widget size
    if (!m_overlay.isNull()) {
        setPixmap(QPixmap::fromImage(m_overlay.scaled(
                size(), Qt::KeepAspectRatio, Qt::SmoothTransformation)));
    }
}

