Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
void SAM3Canvas::clearOverlay() {
    m_original = QImage();
    m_overlay = QImage();
    m_maskOverlay = QImage();
    clearPoints();
    m_hasBox = false;
    m_box = QRectF();
    updatePlaceholderText();
    setPixmap(QPixmap());
}

void SAM3Canvas::addPosPoint(const QPointF& p) {
    m_posPoints.append(p);
    updateOverlay();
}

void SAM3Canvas::addNegPoint(const QPointF& p) {
    m_negPoints.append(p);
    updateOverlay();
}

void SAM3Canvas::clearPoints() {
    m_posPoints.clear();
    m_negPoints.clear();
    m_hasBox = false;
    m_box = QRectF();
    updateOverlay();
}

void SAM3Canvas::clearPointsKeepBox() {
    m_posPoints.clear();
    m_negPoints.clear();
    updateOverlay();
}

QPointF SAM3Canvas::screenToImage(const QPointF& screen) const {
    const QPixmap* pm = pixmap();
    if (!pm || pm->isNull() || m_original.isNull()) return QPointF(-1, -1);
    // The pixmap is centered inside the QLabel (Qt::AlignCenter); its top-left
    // corner is offset from the widget origin by half the letterbox margin.
    const double offX = (width() - pm->width()) / 2.0;
    const double offY = (height() - pm->height()) / 2.0;
    const double ix = (screen.x() - offX) / pm->width() * m_original.width();
    const double iy = (screen.y() - offY) / pm->height() * m_original.height();
    return QPointF(ix, iy);
}

void SAM3Canvas::mouseDoubleClickEvent(QMouseEvent* e) {
    if (!m_original.isNull()) {
        ecvClickableImageLabel::showEnlargedImage(
                this, m_original, tr("SAM3 — full image preview"));
        return;
    }
    QLabel::mouseDoubleClickEvent(e);
}

void SAM3Canvas::mousePressEvent(QMouseEvent* e) {
    if (!m_interactive || m_original.isNull()) {
        QLabel::mousePressEvent(e);
        return;
    }
    if (e->button() == Qt::LeftButton) {
        const QPointF ip = screenToImage(e->localPos());
        if (isInsideImage(ip)) {
            m_dragging = true;
            m_dragStart = ip;
            m_dragRect = QRectF(ip, QSizeF(0, 0));
        }
    } else if (e->button() == Qt::RightButton) {
        const QPointF ip = screenToImage(e->localPos());
        if (isInsideImage(ip)) {
            addNegPoint(ip);
            emit pointAdded(1);
        }
    }
}

void SAM3Canvas::mouseMoveEvent(QMouseEvent* e) {
    if (m_dragging) {
        const QPointF ip = screenToImage(e->localPos());
        m_dragRect = QRectF(m_dragStart, ip).normalized();
        // Show drag rectangle on overlay
        QImage display = m_original.copy();
        QPainter p(&display);
        if (!m_maskOverlay.isNull()) {
            p.drawImage(0, 0, m_maskOverlay);
        }
        drawAnnotations(p, display);
        // Outline only: drawAnnotations may leave a filled brush active
        // (positive / negative point ellipses); drawing the drag rect with
        // that leftover brush filled its interior and hid the image under
        // it, making the box impossible to position.
        p.setBrush(Qt::NoBrush);
        p.setPen(QPen(QColor(255, 255, 0, 180), 2));
        p.drawRect(QRectF(
                m_dragRect.left() / m_original.width() * display.width(),
                m_dragRect.top() / m_original.height() * display.height(),
                m_dragRect.width() / m_original.width() * display.width(),
                m_dragRect.height() / m_original.height() * display.height()));
        p.end();
        m_overlay = display;
        setPixmap(QPixmap::fromImage(display.scaled(size(), Qt::KeepAspectRatio,
                                                    Qt::SmoothTransformation)));
    }
}

void SAM3Canvas::mouseReleaseEvent(QMouseEvent* e) {
    if (!m_dragging) {
        QLabel::mouseReleaseEvent(e);
        return;
    }
    m_dragging = false;

    QPointF ip = screenToImage(e->localPos());
    // Clamp so drags that leave the widget stay valid image coordinates
    ip.setX(qBound(0.0, ip.x(), m_original.width() - 1.0));
    ip.setY(qBound(0.0, ip.y(), m_original.height() - 1.0));

    const double dx = ip.x() - m_dragStart.x();
    const double dy = ip.y() - m_dragStart.y();

    if (dx * dx + dy * dy > 25.0) {
        // Drag → bounding box
        const QRectF drawn = QRectF(m_dragStart, ip).normalized();
        if (m_exemplarMode) {
            // Exemplar (PCS): the box joins the green exemplar list via the
            // boxDrawn(QRectF) payload; the PVS prompt-box slots stay
            // untouched and existing detections stay visible until the next
            // run — upstream main_image.cpp accumulates pos_exemplars next
            // to the live result.
            updateOverlay();
        } else {
            // Points / Box (PVS): a fresh prompt supersedes the previous
            // result — drop the stale detection boxes so the new prompt box
            // is visible immediately (drawAnnotations hides the prompt box
            // while detection boxes exist, to keep one box per object).
            m_detections.clear();
            m_box = drawn;
            m_hasBox = true;
            updateOverlay();
        }
        emit boxDrawn(drawn);
    } else {
        // Click → positive point
        addPosPoint(m_dragStart);
        emit pointAdded(0);
    }
}

void SAM3Canvas::paintEvent(QPaintEvent* e) {
    QLabel::paintEvent(e);
    // Extra overlay handled in mouseMoveEvent; paintEvent draws the pixmap
}

void SAM3Canvas::drawAnnotations(QPainter& p, const QImage& display) {
    const double scaleX =
            static_cast<double>(display.width()) / m_original.width();
    const double scaleY =
            static_cast<double>(display.height()) / m_original.height();

    // Positive points (green)
    p.setPen(QPen(Qt::white, 2));
    p.setBrush(QColor(0, 255, 0, 220));
    for (const auto& pt : m_posPoints) {
        p.drawEllipse(QPointF(pt.x() * scaleX, pt.y() * scaleY), 6, 6);
    }

    // Negative points (red)
    p.setBrush(QColor(255, 0, 0, 220));
    for (const auto& pt : m_negPoints) {
        p.drawEllipse(QPointF(pt.x() * scaleX, pt.y() * scaleY), 6, 6);
    }

    // Exemplar boxes (green), upstream main_image.cpp: pos_exemplars drawn
    // as 2px green rects.
    for (const auto& ex : m_exemplars) {
        p.setPen(QPen(QColor(0, 255, 0, 200), 2));
        p.setBrush(Qt::NoBrush);
        p.drawRect(QRectF(ex.left() * scaleX, ex.top() * scaleY,
                          ex.width() * scaleX, ex.height() * scaleY));
    }

    // Confirmed box (cyan) — hidden in Exemplar (PCS) mode where the green
    // exemplar rects above are the only boxes (upstream main_image.cpp).
    // Also hidden while detection boxes exist: a PVS box prompt's result
    // covers the same region, and stacking both rectangles on one object
    // reads as two overlapping results. The prompt box returns as soon as
    // the detections are cleared (Clear button / a freshly dragged box).
    if (m_hasBox && !m_exemplarMode && m_detections.isEmpty()) {
        p.setPen(QPen(QColor(0, 255, 255, 220), 3));
        p.setBrush(Qt::NoBrush);
        p.drawRect(QRectF(m_box.left() * scaleX, m_box.top() * scaleY,
                          m_box.width() * scaleX, m_box.height() * scaleY));
    }

    // Detection boxes + labels (upstream main_image.cpp: rect + "#id score")
    for (const auto& det : m_detections) {
        p.setPen(QPen(det.color, 2));
        p.setBrush(Qt::NoBrush);
        p.drawRect(QRectF(det.box.left() * scaleX, det.box.top() * scaleY,
                          det.box.width() * scaleX, det.box.height() * scaleY));
        p.drawText(QPointF(det.box.left() * scaleX + 2,
                           det.box.top() * scaleY + 2),
                   QString("#%1 %2")
                           .arg(det.instanceId)
                           .arg(det.score, 0, 'f', 2));
    }
}

// ── Drag & drop ──────────────────────────────────────────────────────────

void SAM3Canvas::dragEnterEvent(QDragEnterEvent* e) {
    if (e->mimeData()->hasUrls()) {
        e->acceptProposedAction();
    }
}

void SAM3Canvas::dropEvent(QDropEvent* e) {
    const auto urls = e->mimeData()->urls();
    if (urls.isEmpty()) return;
    const QString path = urls.first().toLocalFile();
    if (path.isEmpty()) return;

    QImage img(path);
    if (img.isNull()) return;
    setImage(img);
    emit imageDropped(path);
}

// ---------------------------------------------------------------------------
// SAM3Dialog implementation
// ---------------------------------------------------------------------------

SAM3Dialog::SAM3Dialog(QWidget* parent) : QDialog(parent) {
    // Cross-thread queue connections (SAM3Worker / VideoWorker emit
    // resultReady / frameResultReady from their worker threads) require the
    // custom result type to be registered with Qt's meta-type system;
    // without this the queued signal is silently dropped and the UI never
    // updates (mirrors the qYOLO/qRFDetr/qDeepLSD qRegisterMetaType calls).
    qRegisterMetaType<SAM3WorkerResult>();
    setWindowTitle(tr("SAM3 Image & Video Segmentation"));
    setMinimumSize(ecvAICoreUi::dpiScaled(900), ecvAICoreUi::dpiScaled(700));
    setupUi();

    // Shared model downloader (qDA3-style): catalog GGUFs land in the AICore
    // model cache (sam3_models) and are verified by size + GGUF magic.
    m_modelDownloader = new ecvModelDownloader(this);
    connect(m_modelDownloader, &ecvModelDownloader::logMessage, this,
            &SAM3Dialog::appendLog);
    connect(m_modelDownloader, &ecvModelDownloader::progress, this,
            [this](qint64 received, qint64 total) {
                if (total > 0 && m_progress) {
                    m_progress->setValue(
                            static_cast<int>(received * 100 / total));
                }
                if (m_downloadLabel) {
                    m_downloadLabel->setText(
                            tr("Downloading %1 — %2")
                                    .arg(m_downloadTargetFilename)
                                    .arg(ecvModelDownloader::
                                                 formatDownloadProgress(
                                                         received, total)));
                }
            });
    connect(m_modelDownloader, &ecvModelDownloader::finished, this,
            [this](bool ok, const QString& dest) {
                const bool thenRun = m_downloadThenRun;
                const int tab = m_downloadTab;
                const QString filename = m_downloadTargetFilename;
                const bool valid = ok && isValidCatalogModel(dest, filename);
                m_downloadInProgress = false;
                m_downloadThenRun = false;
                if (m_downloadLabel) m_downloadLabel->setVisible(false);
                if (m_progress) m_progress->setVisible(false);
                refreshModelCombos();
                updateDownloadButtons();
                setBusy(false);
                if (valid) {
                    m_downloadPrompted = false;
                    appendLog(tr("Model downloaded: %1").arg(filename));
                    if (thenRun && static_cast<int>(currentTab()) == tab) {
                        // Re-run the pending operation now that the GGUF
                        // exists (lazy model load on first use).
                        m_retryAfterModelLoad = true;
                        autoLoadModelIfAvailable();
                    }
                } else {
                    appendLog(tr("Model download failed or did not pass "
                                 "catalog validation: %1")
                                      .arg(filename));
                }
                m_downloadTargetFilename.clear();
            });

    loadSettings();

