Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
    // Closing the dialog for good (X button / Esc / system close) drops all
    // resident GPU contexts; being merely hidden or occluded must not.
    // QDialog::closeEvent ends in reject(), so rejected() covers the X
    // button as well as Esc. Idempotent.
    connect(this, &QDialog::rejected, this, &SAM3Dialog::releaseGpuResidency);
}

void SAM3Dialog::showEvent(QShowEvent* e) {
    QDialog::showEvent(e);
    if (m_firstShow) {
        m_firstShow = false;
        adjustSize();
        // No eager model load on dialog open: the initial model (or a model
        // switched later) loads lazily on the first Segment / click / box.
        updateStatus(
                tr("Ready. The selected model loads automatically on "
                   "the first Segment / click / box."));
    }
    if (m_busyOverlay) {
        m_busyOverlay->setGeometry(rect());
        m_busyOverlay->raise();
    }
}

void SAM3Dialog::resizeEvent(QResizeEvent* e) {
    QDialog::resizeEvent(e);
    if (m_busyOverlay) {
        m_busyOverlay->setGeometry(rect());
    }
}

void SAM3Dialog::closeEvent(QCloseEvent* e) {
    // The dialog object is reused (hidden, not deleted) — but a closed
    // qSAM3 window means the user is done with it. If a task is still
    // running, ask for confirmation before cancelling it.
    if (isRunning()) {
        if (QMessageBox::question(this, tr("Task running"),
                                  tr("A SAM3 task is running. Close anyway?"),
                                  QMessageBox::Yes | QMessageBox::No,
                                  QMessageBox::No) != QMessageBox::Yes) {
            e->ignore();
            return;
        }
    }
    stopWorker();  // no-op when idle; cancels + bounded-waits otherwise
    saveSettings();
    QDialog::closeEvent(e);
}

void SAM3Dialog::keyPressEvent(QKeyEvent* e) {
    if (e->key() == Qt::Key_Escape && isRunning()) {
        if (QMessageBox::question(this, tr("Task running"),
                                  tr("A SAM3 task is running. Close anyway?"),
                                  QMessageBox::Yes | QMessageBox::No,
                                  QMessageBox::No) != QMessageBox::Yes) {
            return;
        }
    }
    QDialog::keyPressEvent(e);
}

void SAM3Dialog::releaseGpuResidency() {
    // Cancels a running task (bounded wait) and drops every resident
    // context; safe to call repeatedly (closeEvent and rejected both land
    // here).
    stopWorker();
    // A cancelled task has no pending operation; also drop the deferred
    // device-reload flag so it never fires on a later, unrelated finish.
    m_retryAfterModelLoad = false;
    m_retryCanvasPrompt = false;
    m_reloadAfterCurrentTask = false;
    if (m_downloadInProgress && m_modelDownloader) m_modelDownloader->cancel();
    if (m_videoTab) m_videoTab->releaseModel();
}

SAM3Dialog::~SAM3Dialog() {
    saveSettings();
    stopWorker();
    // Teardown guard: QObject destroys children (page shell -> VideoTab)
    // AFTER this class's members (m_pageStack, m_backendLabel) are gone. The
    // VideoTab destructor calls releaseModel(), which emits backendChanged;
    // the setupUi() lambda connected with `this` context would then run on
    // destroyed members (SIGSEGV in QFunctorSlotObject). Disconnect before
    // the deleteChildren cascade.
    if (m_videoTab) {
        disconnect(m_videoTab, &VideoTab::backendChanged, this, nullptr);
    }
}

void SAM3Dialog::setupUi() {
    auto* mainLayout = new QVBoxLayout(this);
    mainLayout->setContentsMargins(8, 8, 8, 8);
    mainLayout->setSpacing(6);

    // ── Device row (shared across the image tabs, compact, on top) ───────
    auto* deviceRow = new QHBoxLayout();

    auto* deviceLabel = new QLabel(tr("Device:"));
    m_deviceCombo = new QComboBox();
    // Devices follow the runtime backend registry (aicore/backend_capi.h),
    // which lists only the backends registered on this platform — Metal ->
    // CPU on macOS, Vulkan/CUDA -> CPU on Linux/Windows — so the combo never
    // offers a device the core cannot resolve. Item data carries the device
    // id passed to the C API; labels are display-only.
    for (int i = 0; i < aicore_device_count(); ++i) {
        const aicore_device_info* dev = aicore_device_at(i);
        if (!dev || !dev->id) continue;
        m_deviceCombo->addItem(QString::fromUtf8(dev->label),
                               QString::fromUtf8(dev->id));
        if (dev->is_default) m_deviceCombo->setCurrentIndex(i);
    }
    connect(m_deviceCombo, QOverload<int>::of(&QComboBox::currentIndexChanged),
            this, &SAM3Dialog::onDeviceChanged);

    m_backendLabel = new QLabel(tr("Backend: none"));
    m_backendLabel->setStyleSheet("color: #99b4d1;");

    deviceRow->addWidget(deviceLabel);
    deviceRow->addWidget(m_deviceCombo);
    deviceRow->addSpacing(20);
    deviceRow->addWidget(m_backendLabel);
    deviceRow->addStretch();
    mainLayout->addLayout(deviceRow);

    // ── Page shell (qYOLO-style: left page list + stacked pages)
    // ────────────────────
    m_pageList = new QListWidget(this);
    m_pageList->setFixedWidth(ecvAICoreUi::dpiScaled(132));
    m_pageList->setSpacing(ecvAICoreUi::dpiScaled(2));
    // Palette-based list styling lifted from YOLODialog::setupUi: tracks
    // light/dark themes without hardcoded colors. Four short-titled pages
    // never overflow, so a fixed-width list (TrellisDialog rendition) needs
    // no draggable splitter / persisted splitter state.
    m_pageList->setStyleSheet(
            QStringLiteral("QListWidget { background: palette(base); border: "
                           "1px solid palette(mid); border-radius: 3px; "
                           "padding: 2px; }"
                           "QListWidget::item { padding: 4px 6px; "
                           "border-radius: 3px; }"
                           "QListWidget::item:selected { background: "
                           "palette(highlight); color: "
                           "palette(highlighted-text); }"));
    m_pageStack = new QStackedWidget(this);

    // Model-switch hint: the new model loads lazily on the next Segment /
    // click / box (no reload while the dialog is idle).
    const auto onModelComboChanged = [this]() {
        m_downloadPrompted = false;
        if (m_worker && m_worker->context() && modelSelectionChanged()) {
            appendLog(
                    tr("Model changed - the new model will load on the "
                       "next Segment / click / box."));
        }
        updateDownloadButtons();
    };

    // Each image tab mirrors the upstream main_image.cpp single panel:
    // two compact control rows, the canvas expanding to fill all remaining
    // space and a compact bottom bar. Nothing is shared with the Video tab,
    // so the image tabs are never stretched by the video layout.
    auto buildImageTab = [this, &onModelComboChanged](Sam3Tab which,
                                                      const QString& title,
                                                      bool isFull) {
        ImageTabUi& u = m_tabsUi[static_cast<int>(which)];
        u.tab = new QWidget();
        auto* layout = new QVBoxLayout(u.tab);
        ecvAICoreUi::setupTabLayout(layout);

        // Row 1: mode + (Full: text prompt + Segment) + test-image picker
        auto* row1 = new QHBoxLayout();
        auto* modeLabel = new QLabel(tr("Mode:"));
        u.modePoints = new QRadioButton(tr("Points"));
        u.modeBox = new QRadioButton(tr("Box (PVS)"));
        u.modeBox->setChecked(true);
        u.modeExemplar =
                isFull ? new QRadioButton(tr("Exemplar (PCS)")) : nullptr;
        auto* modeGroup = new QButtonGroup(this);
        modeGroup->addButton(u.modePoints, 0);
        modeGroup->addButton(u.modeBox, 1);
        if (u.modeExemplar) modeGroup->addButton(u.modeExemplar, 2);
        connect(modeGroup, QOverload<int>::of(&QButtonGroup::buttonClicked),
                this, &SAM3Dialog::onModeChanged);

