Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
        if (isFull) {
            u.textPrompt = new QLineEdit();
            u.textPrompt->setPlaceholderText(
                    tr("Describe the object to "
                       "segment (e.g. person, "
                       "car)..."));
            u.textPrompt->setMinimumWidth(ecvAICoreUi::dpiScaled(240));
            connect(u.textPrompt, &QLineEdit::returnPressed, this,
                    &SAM3Dialog::onRunSegment);
            u.segmentBtn = new QPushButton(tr("Segment"));
            u.segmentBtn->setEnabled(false);
            u.segmentBtn->setStyleSheet(
                    "QPushButton { background: #00897b; color: white; "
                    "font-weight: bold;"
                    "  border: none; border-radius: 4px; padding: 5px 14px; }"
                    "QPushButton:hover { background: #00796b; }"
                    "QPushButton:disabled { background: #555; color: #999; }");
            connect(u.segmentBtn, &QPushButton::clicked, this,
                    &SAM3Dialog::onRunSegment);
        }

        u.testDataCombo = new QComboBox();
        u.testDataCombo->setMinimumWidth(ecvAICoreUi::dpiScaled(140));
        u.testDataCombo->setToolTip(
                tr("Pick which sample image to load (SAM3 test dataset)"));

        u.testDataBtn = ecvAICoreUi::makeSampleDataBtn(this);
        u.testDataBtn->setToolTip(
                tr("Download (cached) and load the selected sample image for "
                   "one-click testing"));
        connect(u.testDataBtn, &QPushButton::clicked, this,
                &SAM3Dialog::requestTestData);
        // Switching the picker auto-loads that sample into this tab's
        // canvas immediately (no need to press the sample-data button
        // again once the dataset is cached).
        connect(u.testDataCombo,
                QOverload<int>::of(&QComboBox::currentIndexChanged), this,
                [this, &u](int) {
                    if (u.currentImage.isNull() || isRunning()) {
                        // Nothing to replace yet, or a task is using the
                        // current image; the next click re-runs anyway.
                        return;
                    }
                    loadTestImageInto(u);
                    appendLog(
                            tr("Sample switched - the selected model "
                               "re-encodes the new image on the next "
                               "Segment / click / box."));
                });

        row1->addWidget(modeLabel);
        row1->addWidget(u.modePoints);
        row1->addWidget(u.modeBox);
        if (u.modeExemplar) row1->addWidget(u.modeExemplar);
        if (isFull) {
            row1->addSpacing(10);
            row1->addWidget(u.textPrompt, 1);
            row1->addWidget(u.segmentBtn);
        }
        row1->addSpacing(10);
        row1->addWidget(u.testDataCombo);
        row1->addWidget(u.testDataBtn);
        layout->addLayout(row1);

        // Row 2: model + Load
        auto* row2 = new QHBoxLayout();
        auto* modelLabel = new QLabel(tr("Model:"));
        u.modelCombo = new QComboBox();
        u.modelCombo->setMinimumWidth(ecvAICoreUi::dpiScaled(240));
        u.loadBtn = new QPushButton(tr("Load"));
        u.loadBtn->setStyleSheet(
                "QPushButton { background: #00897b; color: white; "
                "font-weight: bold;"
                "  border: none; border-radius: 4px; padding: 5px 14px; }"
                "QPushButton:hover { background: #00796b; }");
        // No manual Load step: the model loads lazily on the first Segment /
        // click / box. The button stays wired for the Browse fallback but
        // is hidden so the UI matches the upstream flow.
        u.loadBtn->setVisible(false);
        connect(u.loadBtn, &QPushButton::clicked, this,
                &SAM3Dialog::onLoadModel);
        connect(u.modelCombo,
                QOverload<int>::of(&QComboBox::currentIndexChanged), this,
                onModelComboChanged);
        row2->addWidget(modelLabel);
        row2->addWidget(u.modelCombo, 1);
        // One-click download of the selected catalog GGUF into the shared
        // AICore model cache (sam3_models), qDA3-style.
        u.downloadBtn = new QPushButton(tr("Download"));
        u.downloadBtn->setToolTip(
                tr("Download the selected model GGUF into the model cache"));
        connect(u.downloadBtn, &QPushButton::clicked, this, [this]() {
            if (!m_downloadInProgress) startDownload(false);
        });
        row2->addWidget(u.downloadBtn);
        row2->addWidget(u.loadBtn);
        layout->addLayout(row2);

        // Canvas: fills all remaining tab space (upstream: the image region
        // is the whole panel below the compact controls).
        u.canvas = new SAM3Canvas();
        u.canvas->setSizePolicy(QSizePolicy::Expanding, QSizePolicy::Expanding);
        connect(u.canvas, &SAM3Canvas::pointAdded, this,
                &SAM3Dialog::onCanvasPoint);
        connect(u.canvas, &SAM3Canvas::boxDrawn, this,
                &SAM3Dialog::onCanvasBox);
        connect(u.canvas, &SAM3Canvas::imageDropped, this,
                [this, &u](const QString& path) {
                    QImage img(path);
                    if (img.isNull()) return;
                    u.currentImage = img;
                    u.currentImagePath = path;
                    // The canvas already displayed the image in dropEvent()
                    // (setImage → clearPoints); calling it again here would
                    // re-decode/rescale the full image and reset the prompt
                    // state a second time.
                    appendLog(tr("Loaded image: %1")
                                      .arg(QFileInfo(path).fileName()));
                    if (m_worker && m_worker->context()) {
                        appendLog(
                                tr("Model ready — click on an object or "
                                   "drag a box to segment it."));
                    } else {
                        appendLog(
                                tr("The selected model loads automatically "
                                   "on the first Segment / click / box."));
                    }
                    updateSegmentButtonState();
                });
        layout->addWidget(u.canvas, 1);

        // Bottom bar (compact, mirroring the upstream bottom panel)
        auto* bottom = new QHBoxLayout();
        u.detLabel = new QLabel(tr("Detections: 0 instances"));
        u.scoreSpin = new QDoubleSpinBox();
        u.scoreSpin->setRange(0.0, 1.0);
        u.scoreSpin->setDecimals(2);
        u.scoreSpin->setSingleStep(0.05);
        u.scoreSpin->setValue(0.5);
        ecvAICoreUi::setCompactDoubleSpin(u.scoreSpin);
        auto* scoreLabel = new QLabel(tr("Score threshold:"));

        u.showMasks = new QCheckBox(tr("Show masks"));
        u.showMasks->setChecked(true);
        connect(u.showMasks, &QCheckBox::toggled, this, [this](bool) {
            if (currentUi().lastResult.valid) {
                updateCanvasFromResult();
            }
        });

        u.exportToDbCheckBox = new QCheckBox(tr("Export to DB"));
        u.exportToDbCheckBox->setChecked(false);  // opt-in, not automatic
        u.exportToDbCheckBox->setToolTip(
                tr("Automatically add the segmented result to the DB tree "
                   "as an annotated image"));

        u.multimask = new QCheckBox(tr("Multi-mask (PVS)"));
        u.multimask->setToolTip(
                tr("PVS mask-decoder output mode.\n"
                   "ON: run the decoder with 3 candidate masks (whole "
                   "object / part / subpart) and return the one with the "
                   "highest predicted IoU — helps point prompts on objects "
                   "with an ambiguous extent (planes, crowds, herds...).\n"
                   "OFF: return the single default mask. Recommended for box "
                   "prompts, where the box already defines the extent."));

        u.clearBtn = new QPushButton(tr("Clear"));
        connect(u.clearBtn, &QPushButton::clicked, this, &SAM3Dialog::onClear);
        u.exportBtn = new QPushButton(tr("Export masks"));
        u.exportBtn->setToolTip(
                tr("Export the current detections' per-instance masks as "
                   "grayscale images into the DB tree"));
        connect(u.exportBtn, &QPushButton::clicked, this,
                &SAM3Dialog::onExportMasks);

        u.statusLabel = new QLabel(tr("Ready."));
        u.statusLabel->setStyleSheet("color: #99ccff;");
        // Timing / log lines are long; wrap instead of clipping at the
        // right dialog edge.
        u.statusLabel->setWordWrap(true);

        bottom->addWidget(u.detLabel);
        bottom->addWidget(scoreLabel);
        bottom->addWidget(u.scoreSpin);
        bottom->addWidget(u.showMasks);
        bottom->addWidget(u.exportToDbCheckBox);
        bottom->addWidget(u.multimask);
        bottom->addSpacing(16);
        bottom->addWidget(u.clearBtn);
        bottom->addWidget(u.exportBtn);
        bottom->addWidget(u.statusLabel, 1);
        layout->addLayout(bottom);

        // Detection list: wraps to multiple lines (10+ instances overflow
        // a single row) and stays selectable for copying scores out.
        u.detectionLabel = new QLabel();
        u.detectionLabel->setWordWrap(true);
        u.detectionLabel->setTextInteractionFlags(Qt::TextSelectableByMouse);
        layout->addWidget(u.detectionLabel);

        m_pageStack->addWidget(u.tab);
        m_pageList->addItem(title);
    };

    buildImageTab(Sam3Tab::Full, tr("SAM 3 Full"), /*isFull=*/true);
    buildImageTab(Sam3Tab::Visual, tr("SAM 3 Visual"), /*isFull=*/false);
    buildImageTab(Sam3Tab::Sam2, tr("SAM 2 / 2.1"), /*isFull=*/false);

#ifdef HAS_OPENCV_FACE_CAPTURE
    // Video segmentation & tracking (upstream examples/main_video.cpp):
    // fully self-contained page with its own canvas, timeline, device combo
    // and bottom bar — it never shares layout state with the image tabs.
    m_videoTab = new VideoTab();
    if (m_app) {
        m_videoTab->setAppInterface(m_app);
    }
    connect(m_deviceCombo, QOverload<int>::of(&QComboBox::currentIndexChanged),
            this, [this](int) {
                if (m_videoTab) {
                    m_videoTab->setDevice(
                            m_deviceCombo->currentData().toString());
                }
            });
    connect(m_videoTab, &VideoTab::backendChanged, this,
            [this](const QString& backend) {
                if (m_pageStack && m_videoTab &&
                    m_pageStack->currentWidget() == m_videoTab) {
                    m_backendLabel->setText(tr("Backend: %1").arg(backend));
                }
            });
    m_pageStack->addWidget(m_videoTab);
    m_pageList->addItem(tr("Video"));
#endif

    // The page shell holds the self-contained pages: the list routes, the
    // stack expands to fill the dialog so each page's canvas gets all the
    // remaining space.
    auto* bodyRow = new QHBoxLayout();
    bodyRow->addWidget(m_pageList);
    bodyRow->addWidget(m_pageStack, 1);
    mainLayout->addLayout(bodyRow, 1);

