Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
    // ── Progress section (shared helper, hidden by default) ────────────────
    ecvAICoreUi::setupProgressSection(mainLayout, m_downloadLabel, m_progress);

    // ── Busy overlay (spinner + dim, upstream main_image.cpp overlay) ────
    m_busyOverlay = new QLabel(this);
    m_busyOverlay->setAlignment(Qt::AlignCenter);
    m_busyOverlay->setStyleSheet(
            "QLabel { background: rgba(10,10,16,150); color: white;"
            " font-size: 15px; font-weight: bold; border: none; }");
    m_busyOverlay->setVisible(false);
    m_busyTimer = new QTimer(this);
    m_busyTimer->setInterval(100);
    connect(m_busyTimer, &QTimer::timeout, this, [this]() {
        static const QString kFrames = QString::fromUtf8("⠋⠙⠹⠸⠼⠴⠦⠧⠇⠏");
        const QChar c = kFrames.at(m_busyFrame % kFrames.size());
        m_busyOverlay->setText(QString("%1  Working...").arg(c));
        ++m_busyFrame;
    });

    // ── Connections ─────────────────────────────────────────────────────────
    // QListWidget does not auto-select its first item (QTabWidget did), so
    // set the initial highlight before wiring the callback — the initial
    // onPageChanged-equivalent never fired during construction there either.
    m_pageList->setCurrentRow(0);
    connect(m_pageList, &QListWidget::currentRowChanged, this,
            &SAM3Dialog::onPageChanged);

    // Shared test data repository (SAM3 dataset).
    auto& repo = ecvTestDataRepository::instance();
    connect(&repo, &ecvTestDataRepository::downloadProgress, this,
            [this](int percent, const QString& statusText) {
                if (!m_testDataDownloadInProgress) return;
                updateStatus(QString("%1 (%2%)").arg(statusText).arg(percent));
                if (m_progress) {
                    m_progress->setValue(percent);
                }
            });
    connect(&repo, &ecvTestDataRepository::downloadLogMessage, this,
            [this](const QString& message) {
                if (m_testDataDownloadInProgress) appendLog(message);
            });
    connect(&repo, &ecvTestDataRepository::downloadFinished, this,
            [this](bool success, ecvTestDataRepository::Dataset kind) {
                onTestDataDownloadFinished(success, kind);
            });
    connect(&repo, &ecvTestDataRepository::extractionProgress, this,
            [this](int current, int total) {
                if (!m_testDataDownloadInProgress || total <= 0) return;
                updateStatus(tr("Extracting test data... %1/%2")
                                     .arg(current)
                                     .arg(total));
                if (m_progress && total > 0) {
                    m_progress->setValue(current * 100 / total);
                }
            });
    connect(&repo, &ecvTestDataRepository::extractionFinished, this,
            [this](bool success, ecvTestDataRepository::Dataset kind) {
                onTestDataExtractionFinished(success, kind);
            });

    populateModelCombo(m_tabsUi[0].modelCombo, Sam3Tab::Full);
    populateModelCombo(m_tabsUi[1].modelCombo, Sam3Tab::Visual);
    populateModelCombo(m_tabsUi[2].modelCombo, Sam3Tab::Sam2);

    // Fill the test-image pickers from the (possibly cached) SAM3 dataset.
    populateTestDataCombos();
}

// Model family filter per tab. SAM 2 / 2.1 share one tab (visual-only Hiera).
bool SAM3Dialog::familyMatches(const char* family, Sam3Tab tab) {
    if (!family || !*family) return false;
    switch (tab) {
        case Sam3Tab::Full:
            return std::strcmp(family, "sam3") == 0;
        case Sam3Tab::Visual:
            return std::strcmp(family, "sam3-visual") == 0;
        case Sam3Tab::Sam2:
            return std::strncmp(family, "sam2", 4) == 0;  // sam2 / sam2.1
    }
    return false;
}

void SAM3Dialog::populateModelCombo(QComboBox* combo, Sam3Tab tab) {
    combo->clear();
    const int n = aicore_sam3_model_count();
    if (n <= 0) {
        combo->addItem(tr("(no models)"));
        return;
    }
    // Cache status suffix mirrors qDA3: "[size] ✓" when the GGUF is cached
    // in the shared AICore model cache, "[download]" otherwise.
    char* cacheDirRaw = aicore_sam3_model_cache_dir();
    const QString cacheDir = QString::fromUtf8(cacheDirRaw);
    aicore_sam3_free_buffer(cacheDirRaw);
    // Add all catalog entries for this tab's model family. The catalog already
    // excludes the unpublishable sam3-f32, so every entry (including the
    // sam2/sam2.1 f32 variants) is selectable.
    for (int i = 0; i < n; ++i) {
        const auto* entry = aicore_sam3_model_at(i);
        if (!entry) continue;
        if (!familyMatches(entry->model_family, tab)) continue;
        const QString file = cacheDir + QLatin1Char('/') +
                             QString::fromUtf8(entry->filename);
        QFileInfo fi(file);
        QString suffix;
        if (isValidCatalogModel(fi.absoluteFilePath(),
                                QString::fromUtf8(entry->filename))) {
            suffix =
                    QStringLiteral(" [%1] \u2713")
                            .arg(ecvModelDownloader::formatFileSize(fi.size()));
        } else {
            suffix = QStringLiteral(" [download]");
        }
        combo->addItem(QString("%1 (%2)%3")
                               .arg(entry->display_name)
                               .arg(entry->quant_note)
                               .arg(suffix),
                       entry->filename);
    }
    combo->addItem(tr("Browse..."), QString("__browse__"));
}

void SAM3Dialog::selectModelByFilename(QComboBox* combo,
                                       const QString& filename) {
    if (filename.isEmpty() || !combo) return;
    const int idx = combo->findData(filename);
    if (idx >= 0) combo->setCurrentIndex(idx);
}

void SAM3Dialog::loadSettings() {
    QSettings settings("qSAM3");
    m_settings.device = settings.value("device", "auto").toString();
    m_settings.threads = settings.value("threads", 4).toInt();
    m_settings.scoreThreshold =
            settings.value("scoreThreshold", 0.5).toDouble();
    m_settings.nmsThreshold = settings.value("nmsThreshold", 0.1).toDouble();
    m_settings.modelFull = settings.value("modelFull").toString();
    m_settings.modelVisual = settings.value("modelVisual").toString();
    m_settings.modelSam2 = settings.value("modelSam2").toString();

    // Device ids live in item data (labels are display-only). A stale
    // persisted id (e.g. "vulkan" on a Metal-only build) falls back to the
    // registry default.
    const int di = m_deviceCombo->findData(m_settings.device);
    if (di >= 0) m_deviceCombo->setCurrentIndex(di);
    // Export-to-DB is intentionally NOT persisted: it must be off by
    // default on every start (the user opts in per session; all previews
    // live in the plugin UI). Restoring a previously saved "on" state
    // would silently re-enable DB-tree exports.
    for (ImageTabUi& u : m_tabsUi) {
        if (u.scoreSpin) u.scoreSpin->setValue(m_settings.scoreThreshold);
    }

    selectModelByFilename(m_tabsUi[0].modelCombo, m_settings.modelFull);
    selectModelByFilename(m_tabsUi[1].modelCombo, m_settings.modelVisual);
    selectModelByFilename(m_tabsUi[2].modelCombo, m_settings.modelSam2);
}

void SAM3Dialog::saveSettings() {
    QSettings settings("qSAM3");
    settings.setValue("device", m_settings.device);
    settings.setValue("threads", m_settings.threads);
    settings.setValue("scoreThreshold", m_tabsUi[0].scoreSpin
                                                ? m_tabsUi[0].scoreSpin->value()
                                                : m_settings.scoreThreshold);
    settings.setValue("nmsThreshold", m_settings.nmsThreshold);
    settings.setValue("modelFull",
                      m_tabsUi[0].modelCombo->currentData().toString());
    settings.setValue("modelVisual",
                      m_tabsUi[1].modelCombo->currentData().toString());
    settings.setValue("modelSam2",
                      m_tabsUi[2].modelCombo->currentData().toString());
    // Export-to-DB is deliberately not saved (see loadSettings).
}

QString SAM3Dialog::modelPath() const {
    const QString filename = currentModelCombo()->currentData().toString();
    if (filename.isEmpty() || filename == "__browse__") return QString();
    // Catalog entries contain a basename and must resolve through the shared
    // cache. Only an explicitly browsed absolute path may bypass the catalog.
    const QFileInfo selected(filename);
    if (selected.isAbsolute() && selected.isFile()) {
        return selected.absoluteFilePath();
    }
    // The published GGUFs live in the shared AICore model cache
    // ({CLOUDVIEWER_DATA_ROOT|~}/cloudViewer_data/extract/sam3_models).
    char* dir = aicore_sam3_model_cache_dir();
    const QString cacheDir = QString::fromUtf8(dir);
    aicore_sam3_free_buffer(dir);
    const QString full = cacheDir + "/" + filename;
    if (isValidCatalogModel(full, filename)) return full;
    return filename;
}

void SAM3Dialog::startDownload(bool thenRun) {
    if (m_downloadInProgress || !m_modelDownloader) {
        if (m_downloadInProgress) {
            appendLog(tr("[Warning] A model download is already in progress."));
        }
        return;
    }
    const QString filename = currentModelCombo()->currentData().toString();
    if (filename.isEmpty() || filename == "__browse__") return;
    const auto* entry =
            aicore_sam3_model_by_filename(filename.toUtf8().constData());
    if (!entry || !entry->download_url) return;

    char* dir = aicore_sam3_model_cache_dir();
    const QString cacheDir = QString::fromUtf8(dir);
    aicore_sam3_free_buffer(dir);
    const QString dest = cacheDir + QLatin1Char('/') + filename;
    if (isValidCatalogModel(dest, filename)) {
        appendLog(tr("Model already cached: %1").arg(dest));
        if (thenRun) {
            m_retryAfterModelLoad = true;
            autoLoadModelIfAvailable();
        }
        return;
    }
    ecvAssetIntegrity::removeIfNotVerified(
            dest, {}, 64 * 1024, true,
            ecvAssetIntegrity::OnMiss::CheapChecksOnly, entry->size_bytes);

