Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
    QDir().mkpath(cacheDir);
    m_downloadInProgress = true;
    m_downloadThenRun = thenRun;
    m_downloadTab = static_cast<int>(currentTab());
    m_downloadTargetFilename = filename;
    if (m_downloadLabel) {
        m_downloadLabel->setText(tr("Downloading %1 ...").arg(filename));
        m_downloadLabel->setVisible(true);
    }
    if (m_progress) {
        m_progress->setVisible(true);
        m_progress->setValue(0);
    }
    setBusy(true);
    appendLog(tr("Downloading model %1 (%2) ...")
                      .arg(filename)
                      .arg(ecvModelDownloader::formatFileSize(
                              entry->size_bytes)));

    ecvModelDownloader::Request req;
    req.url = QString::fromUtf8(entry->download_url);
    req.destPath = dest;
    // Content identity from the release digest registry — streamed SHA-256
    // check at ingestion (truncation and corruption both caught, no size
    // guard needed); the verified state is recorded in the ledger.
    req.contentAnchor = {QCryptographicHash::Sha256,
                         ecvAssetIntegrity::PinnedDigest(filename)};
    m_modelDownloader->download(req);
}

void SAM3Dialog::updateDownloadButtons() {
    if (!m_modelDownloader) return;
    char* dir = aicore_sam3_model_cache_dir();
    const QString cacheDir = QString::fromUtf8(dir);
    aicore_sam3_free_buffer(dir);
    for (ImageTabUi& u : m_tabsUi) {
        if (!u.downloadBtn) continue;
        const QString filename = u.modelCombo->currentData().toString();
        const bool isCatalogModel =
                !filename.isEmpty() && filename != "__browse__";
        const bool cached =
                isCatalogModel &&
                isValidCatalogModel(cacheDir + QLatin1Char('/') + filename,
                                    filename);
        u.downloadBtn->setEnabled(!m_downloadInProgress && isCatalogModel &&
                                  !cached && !m_busy);
        u.downloadBtn->setText(cached ? tr("Cached") : tr("Download"));
    }
}

void SAM3Dialog::refreshModelCombos() {
    const QString keep[3] = {
            m_tabsUi[0].modelCombo->currentData().toString(),
            m_tabsUi[1].modelCombo->currentData().toString(),
            m_tabsUi[2].modelCombo->currentData().toString(),
    };
    for (int i = 0; i < 3; ++i) {
        populateModelCombo(m_tabsUi[i].modelCombo, static_cast<Sam3Tab>(i));
        selectModelByFilename(m_tabsUi[i].modelCombo, keep[i]);
    }
}

void SAM3Dialog::applyDbTreeSelection(const QStringList& names) {
    if (names.isEmpty()) return;
    // For now we just log the selection; image loading is drag-and-drop only
    appendLog(tr("DB selection: %1").arg(names.join(", ")));
}

void SAM3Dialog::setAppInterface(ecvMainAppInterface* app) {
    m_app = app;
    // The Video tab needs the interface too; qSAM3 calls this after the
    // dialog is constructed, so forward it here (setupUi's own forwarding
    // runs before m_app is set and is a no-op).
    if (m_videoTab) m_videoTab->setAppInterface(app);
}

void SAM3Dialog::appendLog(const QString& msg) { updateStatus(msg); }

// ── Slots ──────────────────────────────────────────────────────────────────

void SAM3Dialog::onLoadModel() {
    if (isRunning()) {
        appendLog(tr("Worker is busy; wait for the current task to finish."));
        return;
    }

    QString path = modelPath();
    const bool isBrowseItem =
            currentModelCombo()->currentData().toString() == "__browse__";
    if (path.isEmpty() || isBrowseItem) {
        path = QFileDialog::getOpenFileName(
                this, tr("Select SAM3 GGUF model"), QDir::homePath(),
                tr("GGUF files (*.gguf);;All files (*)"));
        if (path.isEmpty()) return;
    } else if (classifyModelFile(
                       currentModelCombo()->currentData().toString()) ==
               ModelFileStatus::Unverified) {
        // A stale generation sits in the cache; say so instead of claiming
        // the GGUF was never downloaded.
        const QString filename = currentModelCombo()->currentData().toString();
        const auto* entry = catalogEntry(filename);
        const QFileInfo stale(cachedModelPath(filename));
        const auto answer = QMessageBox::question(
                this, tr("qSAM3"),
                tr("A local copy of %1 exists but does not match the "
                   "published release (size %2, expected %3).\n\n"
                   "Download the verified version instead?")
                        .arg(filename,
                             ecvModelDownloader::formatFileSize(stale.size()),
                             entry ? ecvModelDownloader::formatFileSize(
                                             entry->size_bytes)
                                   : QStringLiteral("unknown")),
                QMessageBox::Yes | QMessageBox::Cancel, QMessageBox::Cancel);
        if (answer != QMessageBox::Yes) return;
        startDownload(false);
        return;
    } else if (!QFileInfo::exists(path)) {
        // The combo lists published models, but the GGUF itself is not
        // downloaded yet. Tell the user instead of failing silently and
        // leaving the Segment button grey with no explanation.
        const auto answer = QMessageBox::question(
                this, tr("qSAM3"),
                tr("Model file not found:\n%1\n\n"
                   "It has not been downloaded yet. Browse for a local GGUF "
                   "file instead?")
                        .arg(path),
                QMessageBox::Yes | QMessageBox::Cancel, QMessageBox::Cancel);
        if (answer != QMessageBox::Yes) return;
        path = QFileDialog::getOpenFileName(
                this, tr("Select SAM3 GGUF model"), QDir::homePath(),
                tr("GGUF files (*.gguf);;All files (*)"));
        if (path.isEmpty()) return;
    }

    m_modelPath = path;
    m_settings.device = m_deviceCombo->currentData().toString();
    ImageTabUi& u = currentUi();
    if (u.segmentBtn) u.segmentBtn->setEnabled(false);
    setBusy(true);

    startWorker(SAM3WorkerAction::LoadModel);
}

void SAM3Dialog::onRunSegment() { runSegmentation(false); }

void SAM3Dialog::runSegmentation(bool canvasPrompt) {
    ImageTabUi& u = currentUi();
    if (u.currentImage.isNull()) {
        CVLog::Warning("[qSAM3] onRunSegment: no image loaded (tab %d)",
                       static_cast<int>(currentTab()));
        appendLog(tr("No image loaded. Drag and drop an image on the canvas."));
        return;
    }
    if (isRunning()) {
        CVLog::Warning("[qSAM3] onRunSegment: worker busy, Segment ignored");
        appendLog(tr("Worker is busy; wait for the current task to finish."));
        return;
    }
    m_retryCanvasPrompt = canvasPrompt;
    if (!ensureModelReady()) {
        // Model not ready: a lazy load is running (the operation re-runs
        // once it finishes) or the GGUF file is missing (already prompted).
        return;
    }

