Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
    SAM3Worker::Prompt prompt;

    // A non-empty text prompt runs PCS (text + tracking) in every mode of
    // the Full tab: typing "person" and pressing Segment must segment the
    // person without first switching to Exemplar mode.
    const QString text =
            u.textPrompt ? u.textPrompt->text().trimmed() : QString();
    const bool haveText = !canvasPrompt && !text.isEmpty() &&
                          currentTab() == Sam3Tab::Full && !m_visualOnly;

    if (m_visualOnly && !text.isEmpty()) {
        // The C-API rejects PCS on a visual-only model with no feedback;
        // surface the mismatch instead of silently doing nothing.
        QMessageBox::information(
                this, tr("qSAM3"),
                tr("The loaded model is visual-only and cannot read text "
                   "prompts.\n\n"
                   "Click positive points on the object or drag a bounding "
                   "box around it instead."));
        return;
    }

    if (!canvasPrompt && (currentPcsMode() || haveText)) {
        // PCS mode — mirror upstream examples/main_image.cpp: the text
        // prompt is optional; exemplar boxes alone are enough to run PCS
        // (text just adds a guide).
        qstrncpy(prompt.text, text.toUtf8().constData(), sizeof(prompt.text));
        // Exemplar boxes drawn on the canvas (upstream main_image.cpp
        // pos_exemplars): every box is a positive exemplar for PCS.
        for (const auto& b : u.posExemplars) {
            prompt.posExemplars.push_back({static_cast<float>(b.left()),
                                           static_cast<float>(b.top()),
                                           static_cast<float>(b.right()),
                                           static_cast<float>(b.bottom())});
        }
        // A box drawn in Points / Box mode while a text prompt is present
        // acts as an exemplar (text + region hint) instead of being dropped.
        if (prompt.posExemplars.empty() && u.canvas->hasBox()) {
            const QRectF b = u.canvas->box();
            prompt.posExemplars.push_back({static_cast<float>(b.left()),
                                           static_cast<float>(b.top()),
                                           static_cast<float>(b.right()),
                                           static_cast<float>(b.bottom())});
        }
        if (!prompt.text[0] && prompt.posExemplars.empty()) {
            QMessageBox::information(
                    this, tr("qSAM3"),
                    tr("Nothing to segment yet.\n\n"
                       "Type a text prompt, click positive points on the "
                       "object, or drag a bounding box around it."));
            return;
        }
        prompt.scoreThreshold = static_cast<float>(
                u.scoreSpin ? u.scoreSpin->value() : m_settings.scoreThreshold);
        prompt.nmsThreshold = m_settings.nmsThreshold;
        m_worker->setAction(SAM3WorkerAction::EncodeAndSegmentPCS);
    } else {
        // PVS mode: points or box
        const QVector<QPointF>& posPts = u.canvas->posPoints();
        const QVector<QPointF>& negPts = u.canvas->negPoints();
        if (posPts.isEmpty() && !u.canvas->hasBox()) {
            // The C-API requires at least one positive point or a box;
            // negative-only clicks must not start a pointless run. Give
            // visible feedback instead of a silent status-line update.
            QMessageBox::information(
                    this, tr("qSAM3"),
                    tr("Nothing to segment yet.\n\n"
                       "Click positive points on the object, drag a bounding "
                       "box around it, or type a text prompt."));
            return;
        }
        for (const auto& pt : posPts) {
            prompt.posPoints.append(
                    {static_cast<float>(pt.x()), static_cast<float>(pt.y())});
        }
        for (const auto& pt : negPts) {
            prompt.negPoints.append(
                    {static_cast<float>(pt.x()), static_cast<float>(pt.y())});
        }
        if (u.canvas->hasBox()) {
            const QRectF b = u.canvas->box();
            prompt.pvsBox = {static_cast<float>(b.left()),
                             static_cast<float>(b.top()),
                             static_cast<float>(b.right()),
                             static_cast<float>(b.bottom())};
            prompt.usePvsBox = true;
        }
        prompt.multimask = u.multimask->isChecked();
        m_worker->setAction(SAM3WorkerAction::EncodeAndSegmentPVS);
    }

    setBusy(true);
    m_worker->setImage(u.currentImage);
    m_worker->setPrompt(prompt);
    m_worker->start();
}

void SAM3Dialog::onClear() {
    // Drop any pending lazy-load retry so a stale operation never fires
    // after the canvas / prompt have been cleared.
    m_retryAfterModelLoad = false;
    ImageTabUi& u = currentUi();
    u.canvas->clearPoints();
    u.canvas->clearMaskOverlay();
    u.canvas->clearDetections();
    u.canvas->clearExemplars();
    u.canvas->updateOverlay();
    u.lastResult = SAM3WorkerResult{};
    if (u.textPrompt) u.textPrompt->clear();
    u.posExemplars.clear();
    u.detectionLabel->clear();
    updateStatus(tr("Cleared."));
}

void SAM3Dialog::onExportMasks() {
    // One-shot DB export: each per-instance mask lands as its own grayscale
    // ccImage in the DB tree — no filesystem round-trip. The annotated
    // composite belongs to the Export-to-DB checkbox, not to this button.
    ImageTabUi& u = currentUi();
    if (!u.lastResult.valid || u.lastResult.instanceMasks.isEmpty()) {
        appendLog(tr("No masks to export."));
        return;
    }
    const int dbCount = exportMasksToDb(&u);
    if (dbCount > 0) {
        appendLog(tr("Added %1 mask image(s) to the DB tree.").arg(dbCount));
    } else {
        appendLog(tr("No DB interface available; masks were not exported."));
    }
}

int SAM3Dialog::exportMasksToDb(ImageTabUi* target) {
    ImageTabUi& u = target ? *target : currentUi();
    if (!u.lastResult.valid || !m_app || u.lastResult.instanceMasks.isEmpty()) {
        return 0;
    }
    const QString deviceTag =
            ecvPluginDbNaming::deviceTagFromName(m_settings.device);
    // Model tag keeps runs from different checkpoint variants separable
    // in the DB tree (source + device alone collide across variants).
    const QString modelTag =
            ecvPluginDbNaming::modelTagFromFilename(modelPath());
    const QString sourceLabel =
            u.currentImagePath.isEmpty()
                    ? QStringLiteral("canvas")
                    : QFileInfo(u.currentImagePath).completeBaseName();
    int added = 0;
    for (int i = 0; i < u.lastResult.instanceMasks.size(); ++i) {
        const QImage mask = u.lastResult.instanceMasks.value(i);
        if (mask.isNull()) continue;
        const int id = u.lastResult.instanceIds.value(i, i + 1);
        const QString name = ecvPluginDbNaming::makeUnique(
                QStringLiteral("SAM3_%1_%2_%3_mask_obj%4")
                        .arg(modelTag, sourceLabel, deviceTag)
                        .arg(id),
                m_app);
        auto* img = new ccImage(mask, name);
        img->setMetaData(QStringLiteral("SAM3"), true);
        img->setMetaData(QStringLiteral("SAM3/Kind"), QStringLiteral("mask"));
        img->setMetaData(QStringLiteral("SAM3/InstanceId"),
                         static_cast<qlonglong>(id));
        img->setMetaData(QStringLiteral("SAM3/Score"),
                         static_cast<double>(u.lastResult.scores.value(i)));
        const aicore_sam3_box& b = u.lastResult.boxes.value(i);
        img->setMetaData(QStringLiteral("SAM3/Box"),
                         QStringLiteral("[%1,%2,%3,%4]")
                                 .arg(b.x0, 0, 'f', 1)
                                 .arg(b.y0, 0, 'f', 1)
                                 .arg(b.x1, 0, 'f', 1)
                                 .arg(b.y1, 0, 'f', 1));
        img->setMetaData(QStringLiteral("SAM3/Device"), m_settings.device);
        img->setMetaData(QStringLiteral("SAM3/Model"),
                         QFileInfo(m_modelPath).fileName());
        if (!u.currentImagePath.isEmpty()) {
            img->setMetaData(QStringLiteral("Source"), u.currentImagePath);
        }
        m_app->addToDB(img, /*updateZoom=*/false, /*autoExpandDBTree=*/true,
                       /*checkDimensions=*/false, /*autoRedraw=*/true);
        ++added;
    }
    return added;
}

void SAM3Dialog::onWorkerFinished(bool ok) {
    setBusy(false);
    if (!ok) {
        m_tabsUi[m_taskTab].statusLabel->setText(
                tr("Task failed or "
                   "cancelled."));
    }
}

void SAM3Dialog::onWorkerProgress(int current, int total) {
    // Not used for now
}

void SAM3Dialog::onWorkerLog(const QString& msg) {
    if (m_tabsUi[m_taskTab].statusLabel) {
        m_tabsUi[m_taskTab].statusLabel->setText(msg);
    }
}

