Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
void SAM3Dialog::onWorkerResult(const SAM3WorkerResult& result) {
    // Always land on the tab that started the task, even if the user
    // switched tabs while it was running.
    ImageTabUi& u = m_tabsUi[m_taskTab];
    if (!result.valid) {
        u.statusLabel->setText(result.errorMsg.isEmpty() ? tr("No "
                                                              "detections.")
                                                         : result.errorMsg);
        return;
    }
    u.lastResult = result;
    updateCanvasFromResult(&u);
    updateDetectionList(&u);

    // Auto-export to DB tree if enabled (opt-in) and we have an app
    // interface; all previews always stay in the plugin UI.
    if (u.exportToDbCheckBox->isChecked() && m_app) {
        exportToDb(&u);
    }

    const auto& t = result.timings;
    u.statusLabel->setText(
            tr("Done — preprocess %1 ms, inference %2 ms, total %3 ms — "
               "%4 detections")
                    .arg(QString::number(t.preprocess_ms, 'f', 0))
                    .arg(QString::number(t.inference_ms, 'f', 0))
                    .arg(QString::number(t.e2e_ms, 'f', 0))
                    .arg(result.detCount));
}

void SAM3Dialog::onCanvasPoint(int type) {
    ImageTabUi& u = currentUi();
    // Auto-segment on point addition. A negative-only click has no meaning
    // for the C-API (it needs a positive point or a box), so wait until the
    // user has placed a positive point/box.
    if (u.currentImage.isNull()) {
        CVLog::Warning("[qSAM3] canvas point on tab with no image");
        appendLog(tr("Drop an image on the canvas first."));
        return;
    }
    if (type == 1 && u.canvas->posPoints().isEmpty() && !u.canvas->hasBox()) {
        return;
    }
    // The first click lazily loads the model; the segmentation re-runs once
    // the load finishes.
    runSegmentation(true);
}

void SAM3Dialog::onCanvasBox(QRectF box) {
    ImageTabUi& u = currentUi();
    // Auto-segment on box drawn
    if (u.currentImage.isNull()) {
        CVLog::Warning("[qSAM3] canvas box on tab with no image");
        appendLog(tr("Drop an image on the canvas first."));
        return;
    }
    if (currentPcsMode()) {
        // Exemplar (PCS): the drawn box becomes a positive exemplar; the
        // actual search runs when the user presses Segment, matching the
        // upstream main_image.cpp behavior (drag: exemplar box, then
        // Segment runs PCS with text + exemplars). No model is needed to
        // collect the exemplar.
        u.posExemplars.append(box);
        u.canvas->setExemplars(u.posExemplars);
        // Drop pending PVS point prompts, but keep the box prompt slots:
        // upstream stores pos_exemplars and pvs_box independently, so a box
        // drawn in Box (PVS) mode survives exemplar collection and still
        // serves as the fallback exemplar for the next Segment.
        u.canvas->clearPointsKeepBox();
        appendLog(tr("Added positive exemplar box (%1). Press Segment to "
                     "run detection (text is optional).")
                          .arg(u.posExemplars.size()));
        return;
    }
    // The first box lazily loads the model; the segmentation re-runs once
    // the load finishes.
    runSegmentation(true);
}

void SAM3Dialog::onPageChanged(int index) {
    // The page list and the stack are separate widgets (unlike QTabWidget,
    // which switched its internal stack before emitting currentChanged):
    // sync the stack here so the right pane actually shows the selected
    // entry.
    if (m_pageStack && index >= 0 && index < m_pageStack->count()) {
        m_pageStack->setCurrentIndex(index);
    }
    // Video page is identified by widget identity, not by position (index 3
    // today): adding a page after Video must not inherit its exclusive-GPU
    // teardown semantics.
    const bool isVideoPage = m_videoTab && m_pageStack &&
                             m_pageStack->widget(index) == m_videoTab;
    if (isVideoPage) {
        // Image and video contexts can each consume multiple GiB. Keep only
        // the active domain resident so opening Video cannot fail while an
        // image model and its cached graph still occupy the same GPU.
        stopWorker();
        m_modelPath.clear();
        m_backendLabel->setText(tr("Backend: none"));
        return;
    }
#ifdef HAS_OPENCV_FACE_CAPTURE
    if (m_videoTab) m_videoTab->releaseModel();
#endif
    // The active tab defines the interaction mode; refresh the hint text.
    updateStatus(tr("Mode: %1")
                         .arg(currentPcsMode() ? tr("Exemplar (PCS)")
                                               : tr("Points / Box (PVS)")));
    // Keep the current tab's canvas / buttons consistent with its image
    // state (each tab owns its own image, so the segment button state and
    // interactivity must follow the tab switch).
    updateSegmentButtonState();
    if (m_worker && m_worker->context() && modelSelectionChanged()) {
        QListWidgetItem* page =
                m_pageList ? m_pageList->currentItem() : nullptr;
        appendLog(tr("Switched to %1 model family. The new model will load "
                     "automatically on the next Segment / click / box.")
                          .arg(page ? page->text() : QString()));
    }
}

void SAM3Dialog::onModeChanged() {
    ImageTabUi& u = currentUi();
    // The text prompt works in every mode of the Full tab (text + tracking):
    // typing a prompt and pressing Segment runs PCS even in Points / Box
    // mode. Only visual-only models (no text encoder) disable the field.
    const bool textEnabled = (currentTab() == Sam3Tab::Full) && !m_visualOnly;
    if (u.textPrompt) u.textPrompt->setEnabled(textEnabled);
    // Keep the Segment button visible in every mode: in Points / Box it runs
    // the current prompt, in Exemplar it triggers the text-based search.
    if (u.segmentBtn) u.segmentBtn->setVisible(true);
    // Update help text
    if (currentPointsRadio()->isChecked())
        updateStatus(
                tr("Left-click: +point | Right-click: -point | Drag: bounding "
                   "box"));
    else if (currentBoxRadio()->isChecked())
        updateStatus(
                tr("Drag: bounding box (PVS) | Left-click: +point | "
                   "Right-click: -point"));
    else
        updateStatus(tr("Drag: exemplar box | Type text and press Segment"));

    // Exemplar mode draws green exemplar rects and hides the cyan confirmed
    // box, mirroring upstream main_image.cpp pos_exemplars.
    u.canvas->setExemplarMode(currentPcsMode());
    u.canvas->setExemplars(u.posExemplars);
    u.canvas->updateOverlay();
}

void SAM3Dialog::onDeviceChanged(int idx) {
    m_settings.device = m_deviceCombo->itemData(idx).toString();
    if (m_settings.device.isEmpty()) {
        m_settings.device = QStringLiteral("auto");
    }
    // Hot-swap: with a model loaded, re-load it on the newly selected
    // backend right away (upstream main_image.cpp Devices combo triggers
    // reload_model() on the fly). loadSettings() also fires this slot
    // during construction, when m_worker is still null.
    if (m_worker && m_worker->context() && !m_modelPath.isEmpty()) {
        if (isRunning()) {
            m_reloadAfterCurrentTask = true;
            appendLog(tr("Device changed to %1; re-loading when the "
                         "current task finishes.")
                              .arg(m_settings.device));
            return;
        }
        appendLog(tr("Device changed to %1 - reloading model...")
                          .arg(m_settings.device));
        setBusy(true);
        startWorker(SAM3WorkerAction::LoadModel);
    } else {
        appendLog(tr("Device set to %1 (load a model to apply).")
                          .arg(m_settings.device));
    }
}

// ── Private helpers ────────────────────────────────────────────────────────

void SAM3Dialog::startWorker(SAM3WorkerAction action) {
    // The worker is shared, but every callback must land on the tab that
    // started the task (a Ctrl+Tab during a busy run must not write a
    // sibling tab's UI/state).
    m_taskTab = m_pageStack ? qBound(0, m_pageStack->currentIndex(), 2) : 0;
    stopWorker();
    ImageTabUi& u = m_tabsUi[m_taskTab];
    SAM3Worker::Settings s;
    s.modelPath = m_modelPath;
    s.device = m_settings.device;
    s.threads = m_settings.threads;
    s.encodeImgSize = m_settings.encodeImgSize;
    s.scoreThreshold = u.scoreSpin ? static_cast<float>(u.scoreSpin->value())
                                   : m_settings.scoreThreshold;
    s.nmsThreshold = m_settings.nmsThreshold;

    m_worker = new SAM3Worker(s, this);
    if (action == SAM3WorkerAction::LoadModel) {
        m_backendLabel->setText(tr("Backend: loading..."));
    }
    m_worker->setAction(action);
    m_worker->setImage(u.currentImage);
    connect(m_worker, &SAM3Worker::logMessage, this, &SAM3Dialog::onWorkerLog);
    connect(m_worker, &SAM3Worker::resultReady, this,
            &SAM3Dialog::onWorkerResult);
    connect(m_worker, &SAM3Worker::modelReady, this,
            [this](const QString& backend, int, bool vis) {
                m_backendLabel->setText(QString("Backend: %1").arg(backend));
                m_visualOnly = vis;
                // Text prompt / Exemplar only make sense on the Full tab and
                // only for models that carry the text encoder.
                ImageTabUi& u = m_tabsUi[m_taskTab];
                const bool showText = (m_taskTab == 0) && !vis;
                if (u.modeExemplar) u.modeExemplar->setVisible(showText);
                if (u.textPrompt) u.textPrompt->setVisible(showText);
                u.canvas->setInteractive(!u.currentImage.isNull());
                appendLog(tr("Model loaded successfully on %1.").arg(backend));
                if (vis) {
                    appendLog(
                            tr("Model is visual-only; use point / box "
                               "interaction."));
                }
                if (u.currentImage.isNull()) {
                    appendLog(
                            tr("Now drop an image on the canvas (or load "
                               "test data) to start."));
                } else {
                    appendLog(
                            tr("Click on an object or drag a box to "
                               "segment it."));
                }
                updateSegmentButtonState();
            });
    connect(m_worker, &SAM3Worker::finished, this, [this]() {
        setBusy(false);
        if (m_reloadAfterCurrentTask && !m_modelPath.isEmpty()) {
            m_reloadAfterCurrentTask = false;
            appendLog(tr("Re-loading model on %1...").arg(m_settings.device));
            setBusy(true);
            startWorker(SAM3WorkerAction::LoadModel);
            return;
        }
        // A load task that never built a context means the model
        // file failed to load — surface it prominently instead of
        // leaving the Segment button silently disabled.
        if (m_worker && !m_worker->context() &&
            m_worker->action() == SAM3WorkerAction::LoadModel) {
            m_retryAfterModelLoad = false;  // drop pending operation
            m_backendLabel->setText(tr("Backend: none"));
            QMessageBox::warning(
                    this, tr("qSAM3"),
                    tr("Failed to load the model.\n\n"
                       "Check that the GGUF file exists and is "
                       "valid, or pick another model from the list "
                       "(the log above shows the details)."));
        } else if (m_retryAfterModelLoad && m_worker && m_worker->context()) {
            // Lazy load finished: re-run the segmentation the user
            // triggered before the model was ready. Switch back to
            // the tab that started the task so the operation runs
            // against the right image / prompt.
            const bool canvasPrompt = m_retryCanvasPrompt;
            m_retryAfterModelLoad = false;
            m_retryCanvasPrompt = false;
            if (m_pageList && m_pageList->currentRow() != m_taskTab) {
                m_pageList->setCurrentRow(m_taskTab);
            }
            runSegmentation(canvasPrompt);
        }
    });
    m_worker->start();
}

void SAM3Dialog::stopWorker() {
    if (m_worker) {
        m_worker->requestCancel();
        // Segmentation on CPU can take well over 5 s; give the worker a
        // generous window before we fall back to deleting it (deleting a
        // still-running QThread aborts the whole process).
        m_worker->wait(30000);
        delete m_worker;
        m_worker = nullptr;
    }
}

