Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
bool SAM3Dialog::autoLoadModelIfAvailable() {
    if (isRunning()) return false;  // a task is running
    const QString path = modelPath();
    if (path.isEmpty() || path == "__browse__" || !QFileInfo::exists(path)) {
        return false;
    }
    // The same model is already loaded — nothing to do.
    if (m_worker && m_worker->context() &&
        QFileInfo(path).fileName() == QFileInfo(m_modelPath).fileName()) {
        return false;
    }
    m_modelPath = path;
    m_settings.device = m_deviceCombo->currentData().toString();
    appendLog(tr("Auto-loading model: %1 ...").arg(QFileInfo(path).fileName()));
    setBusy(true);
    startWorker(SAM3WorkerAction::LoadModel);
    return true;
}

bool SAM3Dialog::ensureModelReady() {
    // Already loaded and matches the current combo selection.
    if (m_worker && m_worker->context() && !modelSelectionChanged()) {
        return true;
    }
    if (isRunning()) {
        appendLog(tr("Worker is busy; wait for the current task to finish."));
        return false;
    }
    if (autoLoadModelIfAvailable()) {
        // The lazy load runs in the worker; the finished handler re-runs
        // the pending operation once the model is ready.
        m_retryAfterModelLoad = true;
        return false;
    }
    const QString filename = currentModelCombo()->currentData().toString();
    if (filename.isEmpty() || filename == "__browse__") {
        // Browse... has no catalog entry: ask for an explicit pick instead.
        appendLog(
                tr("No model selected. Pick a catalog model or Browse a "
                   "local GGUF file."));
        return false;
    }
    // The combo's GGUF either misses the release check or was never
    // downloaded; offer the verified fetch once per session (qDA3-style).
    if (classifyModelFile(filename) == ModelFileStatus::Unverified) {
        if (!m_downloadPrompted) {
            m_downloadPrompted = true;
            const auto* entry = catalogEntry(filename);
            const QFileInfo stale(cachedModelPath(filename));
            const auto answer = QMessageBox::question(
                    this, tr("qSAM3"),
                    tr("A local copy of %1 exists but does not match the "
                       "published release (size %2, expected %3).\n\n"
                       "Download the verified version now?")
                            .arg(filename,
                                 ecvModelDownloader::formatFileSize(
                                         stale.size()),
                                 entry ? ecvModelDownloader::formatFileSize(
                                                 entry->size_bytes)
                                       : QStringLiteral("unknown")),
                    QMessageBox::Yes | QMessageBox::No);
            if (answer == QMessageBox::Yes) {
                startDownload(true);
                return false;
            }
            appendLog(
                    tr("Cached model does not match the published release. "
                       "Use the Download button or Browse a local GGUF "
                       "file."));
        }
        return false;
    }
    if (!m_downloadPrompted) {
        m_downloadPrompted = true;
        const auto answer = QMessageBox::question(
                this, tr("qSAM3"),
                tr("Model file not found:\n%1\n\n"
                   "Download it now into the model cache?")
                        .arg(modelDisplayPath(filename)),
                QMessageBox::Yes | QMessageBox::No);
        if (answer == QMessageBox::Yes) {
            startDownload(true);
            return false;
        }
        appendLog(
                tr("Model not cached. Use the Download button or "
                   "select a cached model from the combo."));
    }
    return false;
}

bool SAM3Dialog::modelSelectionChanged() const {
    if (!m_worker || !m_worker->context()) return true;
    const QString path = modelPath();
    if (path.isEmpty() || path == "__browse__") return false;
    return QFileInfo(path).absoluteFilePath() !=
           QFileInfo(m_modelPath).absoluteFilePath();
}

void SAM3Dialog::setBusy(bool busy) {
    m_busy = busy;
    for (ImageTabUi& u : m_tabsUi) {
        if (u.loadBtn) u.loadBtn->setEnabled(!busy);
        if (u.modelCombo) u.modelCombo->setEnabled(!busy);
        if (u.testDataBtn) u.testDataBtn->setEnabled(!busy);
        if (u.testDataCombo) u.testDataCombo->setEnabled(!busy);
    }
    m_deviceCombo->setEnabled(!busy);
    updateDownloadButtons();
    // Canvas interactivity and the Segment button are kept in sync by
    // updateSegmentButtonState(); the model loads lazily on first use.
    updateSegmentButtonState();
    if (busy) {
        updateStatus(
                tr("Working... please wait (segmentation may take "
                   "several seconds)"));
    }
    // Spinner overlay covering the whole dialog.
    if (m_busyOverlay) {
        m_busyOverlay->setVisible(busy);
        m_busyOverlay->raise();
        if (busy) {
            m_busyFrame = 0;
            m_busyOverlay->setText(tr("Working..."));
            m_busyTimer->start();
        } else {
            m_busyTimer->stop();
        }
    }
}

void SAM3Dialog::updateSegmentButtonState() {
    ImageTabUi& u = currentUi();
    // The model loads lazily on first use, so the Segment button only needs
    // an image and a non-busy worker; the first click auto-loads the model.
    const bool canRun = !m_busy && !u.currentImage.isNull();
    if (u.segmentBtn) u.segmentBtn->setEnabled(canRun);
    if (u.canvas) {
        u.canvas->setInteractive(canRun);
    }
    if (!canRun && !m_busy && u.currentImage.isNull()) {
        updateStatus(tr("Drop an image on the canvas to start."));
    }
}

void SAM3Dialog::updateCanvasFromResult(ImageTabUi* target) {
    ImageTabUi& u = target ? *target : currentUi();
    // The mask overlay is a layer owned by the canvas; updateOverlay()
    // composites image → mask → annotations in one pass so the mask is
    // never clobbered by the annotation redraw.
    if (u.lastResult.valid && !u.lastResult.maskComposite.isNull() &&
        u.showMasks->isChecked()) {
        u.canvas->setMaskOverlay(u.lastResult.maskComposite);
    } else {
        u.canvas->clearMaskOverlay();
    }
    // Detection boxes + labels, mirroring upstream main_image.cpp.
    static const char* kColors[] = {
            "#ff3333", "#3399ff", "#33e64c", "#ffcc1a", "#cc4ce6",
            "#ff801a", "#1ae6e6", "#e66699", "#80cc33", "#4c4cff",
    };
    const int nColors = sizeof(kColors) / sizeof(kColors[0]);
    QVector<SAM3DetBox> dets;
    if (u.lastResult.valid) {
        for (int i = 0; i < u.lastResult.detCount; ++i) {
            SAM3DetBox det;
            const aicore_sam3_box& b = u.lastResult.boxes.value(i);
            det.box = QRectF(b.x0, b.y0, b.x1 - b.x0, b.y1 - b.y0);
            det.instanceId = u.lastResult.instanceIds.value(i);
            det.score = u.lastResult.scores.value(i);
            det.color = QColor(kColors[i % nColors]);
            dets.append(det);
        }
    }
    u.canvas->setDetections(dets);
    u.canvas->updateOverlay();
}

