Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
void SAM3Dialog::updateDetectionList(ImageTabUi* target) {
    ImageTabUi& u = target ? *target : currentUi();
    // Keep the bottom-left counter in sync with the current result.
    u.detLabel->setText(
            tr("Detections: %1 %2")
                    .arg(u.lastResult.valid ? u.lastResult.detCount : 0)
                    .arg(u.lastResult.detCount == 1 ? tr("instance")
                                                    : tr("instances")));
    if (!u.lastResult.valid || u.lastResult.detCount <= 0) {
        u.detectionLabel->clear();
        return;
    }
    // Spell out what the numbers mean: id = detected object index,
    // score = confidence.
    QString html =
            tr("<span style='color:#888;'>Detected objects "
               "(id — confidence):</span> ");
    static const char* kColors[] = {
            "#ff3333", "#3399ff", "#33e64c", "#ffcc1a", "#cc4ce6",
            "#ff801a", "#1ae6e6", "#e66699", "#80cc33", "#4c4cff",
    };
    const int nColors = sizeof(kColors) / sizeof(kColors[0]);

    for (int i = 0; i < u.lastResult.detCount; ++i) {
        const QString color = kColors[i % nColors];
        html += QString("<span style='color:%1; font-weight:bold;'>"
                        "object #%2 — score %3</span>&nbsp; ")
                        .arg(color)
                        .arg(u.lastResult.instanceIds.value(i))
                        .arg(u.lastResult.scores.value(i), 0, 'f', 2);
    }
    u.detectionLabel->setText(html);
}

void SAM3Dialog::updateStatus(const QString& msg) {
    ImageTabUi& u = currentUi();
    if (u.statusLabel) u.statusLabel->setText(msg);
}

void SAM3Dialog::exportToDb(ImageTabUi* target) {
    ImageTabUi& u = target ? *target : currentUi();
    // Build the annotated image: current image with mask overlay.
    if (!u.lastResult.valid || !m_app) return;

    QImage annotated = u.currentImage;
    if (!u.lastResult.maskComposite.isNull()) {
        // Composite the mask onto the image for a visually useful result.
        QPainter p(&annotated);
        // The mask is a single-channel rgba overlay; we draw it atop.
        const QImage maskRgba = u.lastResult.maskComposite.convertToFormat(
                QImage::Format_RGBA8888_Premultiplied);
        p.drawImage(0, 0, maskRgba);
        p.end();
    }

    const QString deviceTag =
            ecvPluginDbNaming::deviceTagFromName(m_settings.device);
    const QString modelTag =
            ecvPluginDbNaming::modelTagFromFilename(modelPath());
    const QString sourceLabel =
            u.currentImagePath.isEmpty()
                    ? QStringLiteral("canvas")
                    : QFileInfo(u.currentImagePath).completeBaseName();
    const QString name = ecvPluginDbNaming::makeUnique(
            QStringLiteral("SAM3_%1_%2_%3")
                    .arg(modelTag, sourceLabel, deviceTag),
            m_app);

    auto* img = new ccImage(annotated, name);
    img->setMetaData(QStringLiteral("SAM3"), true);
    img->setMetaData(QStringLiteral("SAM3/DetectionCount"),
                     static_cast<qlonglong>(u.lastResult.detCount));
    img->setMetaData(QStringLiteral("SAM3/Device"), m_settings.device);
    img->setMetaData(QStringLiteral("SAM3/Model"),
                     QFileInfo(m_modelPath).fileName());
    img->setMetaData(QStringLiteral("Runtime (ms)"),
                     u.lastResult.timings.e2e_ms);
    if (!u.currentImagePath.isEmpty()) {
        img->setMetaData(QStringLiteral("Source"), u.currentImagePath);
    }

    // Serialise per-instance metadata.
    for (int i = 0; i < u.lastResult.detCount; ++i) {
        const QString p = QStringLiteral("SAM3/Det%1/").arg(i + 1);
        const aicore_sam3_box& b = u.lastResult.boxes.value(i);
        img->setMetaData(
                p + QStringLiteral("InstanceId"),
                static_cast<qlonglong>(u.lastResult.instanceIds.value(i)));
        img->setMetaData(p + QStringLiteral("Score"),
                         static_cast<double>(u.lastResult.scores.value(i)));
        img->setMetaData(p + QStringLiteral("Box"),
                         QStringLiteral("[%1,%2,%3,%4]")
                                 .arg(b.x0, 0, 'f', 1)
                                 .arg(b.y0, 0, 'f', 1)
                                 .arg(b.x1, 0, 'f', 1)
                                 .arg(b.y1, 0, 'f', 1));
    }

    m_app->addToDB(img, /*updateZoom=*/false, /*autoExpandDBTree=*/true,
                   /*checkDimensions=*/false, /*autoRedraw=*/true);
    m_app->setSelectedInDB(img, true);
    appendLog(tr("Added '%1' to DB tree.").arg(name));
}

// ── Tab helpers ────────────────────────────────────────────────────────────

SAM3Dialog::Sam3Tab SAM3Dialog::currentTab() const {
    const int idx = m_pageStack ? m_pageStack->currentIndex() : 0;
    if (idx <= 0) return Sam3Tab::Full;
    if (idx == 1) return Sam3Tab::Visual;
    return Sam3Tab::Sam2;
}

QComboBox* SAM3Dialog::currentModelCombo() const {
    return currentUi().modelCombo;
}

QComboBox* SAM3Dialog::currentTestDataCombo() const {
    return currentUi().testDataCombo;
}

bool SAM3Dialog::currentPcsMode() const {
    // PCS (text / exemplar) only exists on the Full tab.
    const ImageTabUi& u = currentUi();
    return currentTab() == Sam3Tab::Full && u.modeExemplar &&
           u.modeExemplar->isChecked();
}

QRadioButton* SAM3Dialog::currentPointsRadio() const {
    return currentUi().modePoints;
}

QRadioButton* SAM3Dialog::currentBoxRadio() const {
    return currentUi().modeBox;
}

// ── Test data (shared ecvTestDataRepository, SAM3 dataset) ──────────────

void SAM3Dialog::requestTestData() {
    if (m_testDataDownloadInProgress) {
        appendLog(tr("[Test data] Download already in progress."));
        return;
    }
    if (isRunning()) {
        appendLog(tr("[Test data] Wait for the current task to finish."));
        return;
    }
    // Remember which tab asked for the data; the auto-load after extraction
    // lands there even if the user switches tabs while downloading.
    if (m_pageStack) {
        m_testDataTab = qBound(0, m_pageStack->currentIndex(), 2);
    }
    if (loadRequestedTestData()) return;

    auto& repo = ecvTestDataRepository::instance();
    if (repo.isDownloadInProgress()) {
        appendLog(tr("[Test data] Another test-data download is running."));
        return;
    }

