Asher-1/ACloudViewer/plugins/core/Standard/qSAM3/src/SAM3Dialog.cpp
    const auto kind = ecvTestDataRepository::Dataset::SAM3;
    const auto info = ecvTestDataRepository::getDatasetInfo(kind);
    m_testDataDownloadInProgress = true;
    setTestDataControlsEnabled(false);
    if (m_progress) {
        m_progress->setVisible(true);
        m_progress->setValue(0);
    }
    if (m_downloadLabel) {
        m_downloadLabel->setVisible(true);
    }
    if (ecvAssetIntegrity::isVerified(ecvTestDataRepository::zipPath(kind),
                                      info.anchor, 0, false,
                                      ecvAssetIntegrity::OnMiss::DeepVerify)) {
        appendLog(tr("[Test data] Extracting cached archive..."));
        updateStatus(tr("Extracting SAM3 test data..."));
        repo.extractDataset(kind);
        return;
    }
    appendLog(tr("[Test data] Downloading SAM3 test data..."));
    updateStatus(tr("Downloading SAM3 test data..."));
    repo.startDownload(kind);
}

bool SAM3Dialog::loadRequestedTestData() {
    return loadTestImageInto(currentUi());
}

bool SAM3Dialog::loadTestImageInto(ImageTabUi& u) {
    const auto kind = ecvTestDataRepository::Dataset::SAM3;
    if (!u.testDataCombo) return false;
    const QString fileName = u.testDataCombo->currentData().toString();
    if (fileName.isEmpty()) return false;

    const QString path = ecvTestDataRepository::findDatasetFile(kind, fileName);
    if (path.isEmpty()) {
        CVLog::Warning("[qSAM3] test image not found in dataset: %s",
                       fileName.toUtf8().constData());
        return false;
    }

    QImage img(path);
    if (img.isNull()) {
        CVLog::Warning("[qSAM3] test image decode failed: %s",
                       path.toUtf8().constData());
        appendLog(
                tr("[Test data] Failed to decode sample image: %1").arg(path));
        return true;  // cached file exists but is unusable; don't re-download
    }
    u.currentImage = img;
    u.currentImagePath = path;
    u.canvas->setImage(img);
    u.canvas->clearPoints();
    u.canvas->clearExemplars();
    u.posExemplars.clear();
    u.lastResult = SAM3WorkerResult{};
    u.detectionLabel->clear();
    u.detLabel->setText(tr("Detections: 0 instances"));
    appendLog(tr("[Test data] Loaded sample image: %1").arg(path));
    appendLog(
            tr("Click on an object to segment it, or drag a box around "
               "it."));
    if (!m_worker || !m_worker->context()) {
        appendLog(
                tr("The selected model loads automatically on the first "
                   "Segment / click / box."));
    }
    updateSegmentButtonState();
    return true;
}

void SAM3Dialog::populateTestDataCombos() {
    const QStringList images = ecvTestDataRepository::getSamImages(
            ecvTestDataRepository::extractPath(
                    ecvTestDataRepository::Dataset::SAM3));
    for (ImageTabUi& u : m_tabsUi) {
        if (!u.testDataCombo) continue;
        u.testDataCombo->blockSignals(true);
        u.testDataCombo->clear();
        if (images.isEmpty()) {
            u.testDataCombo->addItem(tr("(no test data)"), QString());
        } else {
            for (const QString& path : images) {
                const QString name = QFileInfo(path).fileName();
                u.testDataCombo->addItem(name, name);
            }
        }
        u.testDataCombo->blockSignals(false);
    }
}

void SAM3Dialog::onTestDataDownloadFinished(
        bool success, ecvTestDataRepository::Dataset kind) {
    if (!m_testDataDownloadInProgress ||
        kind != ecvTestDataRepository::Dataset::SAM3) {
        return;
    }
    if (!success) {
        appendLog(tr("[Test data] Download failed."));
        m_testDataDownloadInProgress = false;
        setTestDataControlsEnabled(true);
        if (m_progress) m_progress->setVisible(false);
        if (m_downloadLabel) m_downloadLabel->setVisible(false);
        updateStatus(tr("Ready."));
        return;
    }
    appendLog(tr("[Test data] Extracting..."));
    updateStatus(tr("Extracting SAM3 test data..."));
    if (m_progress) m_progress->setValue(0);
    ecvTestDataRepository::instance().extractDataset(kind);
}

void SAM3Dialog::onTestDataExtractionFinished(
        bool success, ecvTestDataRepository::Dataset kind) {
    if (!m_testDataDownloadInProgress ||
        kind != ecvTestDataRepository::Dataset::SAM3) {
        return;
    }
    m_testDataDownloadInProgress = false;
    setTestDataControlsEnabled(true);

    if (m_progress) m_progress->setVisible(false);
    if (m_downloadLabel) m_downloadLabel->setVisible(false);

    if (!success) {
        appendLog(tr("[Test data] Failed to extract zip archive."));
        updateStatus(tr("Ready."));
        return;
    }
    // The pickers were empty before the first extract; fill them and load
    // the (first) sample so the one-click flow completes automatically on
    // the tab that requested the download.
    populateTestDataCombos();
    if (m_pageList && m_pageList->currentRow() != m_testDataTab) {
        m_pageList->setCurrentRow(m_testDataTab);
    }
    if (!loadRequestedTestData()) {
        appendLog(tr("[Test data] Sample image not found in the archive."));
    }
    updateStatus(tr("Ready."));
}

void SAM3Dialog::setTestDataControlsEnabled(bool enabled) {
    for (ImageTabUi& u : m_tabsUi) {
        if (u.testDataBtn) u.testDataBtn->setEnabled(enabled);
        if (u.testDataCombo) u.testDataCombo->setEnabled(enabled);
    }
}
